Revit 2026 API

# AdvancedWoodWoodEarlyColor Property

---

The property labeled "Earlywood color" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodEarlyColor { get; }
```
```vb
Public Shared ReadOnly Property WoodEarlyColor As String
	Get
```
```cpp
public:
static property String^ WoodEarlyColor {
	String^ get ();
}
```
```fsharp
static member WoodEarlyColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace